Repository: thephez/dash-user-docs
Catalog: locale/*/LC_MESSAGES/docs/user/masternodes/setup.po
Languages: it

source: This guide describes how to set up a Dash masternode. It also describes various options for hosting and different wallets
it: Questa guida descrive come impostare un masternode Dash. Descrive inoltre varie opzioni di hosting e diversi wallet

source: dash, guide, masternodes, trezor, dip3, setup, bls
it: dash, guide, masternodes, trezor, dip3, configura, bls

source: Setup
it: Impostazioni

source: Setting up a masternode requires a basic understanding of Linux and blockchain technology, as well as an ability to follow instructions closely. It also requires regular maintenance and careful security, particularly if you are not storing your Dash on a hardware wallet. There are some decisions to be made along the way, and optional extra steps to take for increased security.
it: La configurazione di un masternode richiede una conoscenza di base di Linux e della tecnologia blockchain, nonché la capacità di seguire attentamente le istruzioni. Richiede inoltre una manutenzione regolare e un'attenta sicurezza, in particolare se non conservi il tuo Dash su un wallet hardware. Ci sono alcune decisioni da prendere lungo il percorso e passaggi aggiuntivi facoltativi da intraprendere per una maggiore sicurezza.

source: Commercial :ref:`masternode hosting services <masternode-hosting>` are available if you prefer to delegate day-to-day operation of your masternode to a professional operator. When using these hosting services, you retain full control of the 1000 DASH collateral and pay an agreed percentage of your reward to the operator. It is also possible to delegate your voting keys to a representative, see the :ref:`governance documentation <delegating-votes>` for more information.
it: Commerciali :ref:`servizi di hosting masternode ` sono disponibili se preferisci delegare la gestione quotidiana del tuo masternode a un operatore professionale. Quando utilizzi questi servizi di hosting, mantieni il pieno controllo della garanzia 1000 DASH e paghi all'operatore una percentuale concordata della tua ricompensa. È anche possibile delegare le proprie chiavi di voto a un rappresentante, consultare la :ref:`documentazione sulla governance` per ulteriori informazioni.

source: Before you begin
it: Prima di iniziare

source: This guide assumes you are setting up a single mainnet masternode for the first time. If you are updating a masternode, see :ref:`here <masternode-update>` instead. You will need:
it: Questa guida presuppone che tu stia configurando per la prima volta un singolo masternode della mainnet. Se stai aggiornando un masternode, vedi invece :ref:`qui <masternode-update>`. Avrai bisogno:

source: A wallet to store your Dash, preferably a hardware wallet, although Dash Core wallet is also supported
it: Un wallet per conservare il tuo Dash, preferibilmente un wallet hardware, sebbene sia supportato anche il wallet Dash Core

source: A Linux server, preferably a Virtual Private Server (VPS)
it: Un server Linux, preferibilmente un server privato virtuale (VPS)

source: Dash 0.13.0 and later implement DIP003, which introduces several changes to how a Dash masternode is set up and operated. While this network upgrade was completed in early 2019, a list of available documentation appears below:
it: Dash 0.13.0 e versioni successive implementano DIP003, che introduce diverse modifiche al modo in cui un masternode Dash viene configurato e gestito. Sebbene questo aggiornamento della rete sia stato completato all'inizio del 2019, di seguito viene visualizzato un elenco della documentazione disponibile:

source: `DIP003 Deterministic Masternode Lists <https://github.com/dashpay/dips/blob/master/dip-0003.md>`__
it: `DIP003 Elenchi masternode deterministici <https://github.com/dashpay/dips/blob/master/dip-0003.md>`__

source: `Dash 0.13 Upgrade Procedure for Masternodes (legacy documentation) <https://docs.dash.org/en/0.13.0/masternodes/dip3-upgrade.html>`__
it: `Procedura di aggiornamento Dash 0.13 per Masternodes (documentazione legacy) <https://docs.dash.org/en/0.13.0/masternodes/dip3-upgrade.html>`__

source: :ref:`Full masternode setup guide <masternode-setup>` (you are here)
it: :ref:`Guida completa all'installazione del masternode ` (sei qui)

source: :ref:`Information for users of hosted masternodes <hosted-setup>`
it: :ref:`Informazioni per gli utenti di masternodes ospitati <hosted-setup>`

source: :ref:`Information for operators of hosted masternodes <operator-transactions>`
it: :ref:`Informazioni per gli utenti di masternodes ospitati <operator-transactions>`

source: This documentation describes the commands as if they were entered in the Dash Core GUI by opening the console from **Window > Console**, but the same result can be achieved on a masternode by entering the same commands and adding the prefix ``~/.dashcore/dash-cli`` to each command.
it: Questa documentazione descrive i comandi come se fossero stati immessi nella GUI Dash Core aprendo la console da **Finestra > Console**, ma lo stesso risultato può essere ottenuto su un masternode inserendo gli stessi comandi e aggiungendo il prefisso ``~ /.dashcore/dash-cli`` a ciascun comando.

source: Set up your VPS
it: Configura il tuo VPS

source: A VPS, more commonly known as a cloud server, is fully functional installation of an operating system (usually Linux) operating within a virtual machine. The virtual machine allows the VPS provider to run multiple systems on one physical server, making it more efficient and much cheaper than having a single operating system running on the "bare metal" of each server. A VPS is ideal for hosting a Dash masternode because they typically offer guaranteed uptime, redundancy in the case of hardware failure and a static IP address that is required to ensure you remain in the masternode payment queue. While running a masternode from home on a desktop computer is technically possible, it will most likely not work reliably because most ISPs allocate dynamic IP addresses to home users.
it: Un VPS, più comunemente noto come server cloud, è l'installazione completamente funzionale di un sistema operativo (solitamente Linux) operante all'interno di una macchina virtuale. La macchina virtuale consente al provider VPS di eseguire più sistemi su un server fisico, rendendolo più efficiente e molto più economico rispetto ad avere un singolo sistema operativo in esecuzione sul "bare metal" di ciascun server. Un VPS è l'ideale per ospitare un masternode Dash perché in genere offre uptime garantito, ridondanza in caso di guasto hardware e un indirizzo IP statico necessario per garantire di rimanere nella coda di pagamento del masternode. Sebbene eseguire un masternode da casa su un computer desktop sia tecnicamente possibile, molto probabilmente non funzionerà in modo affidabile perché la maggior parte degli ISP assegna indirizzi IP dinamici agli utenti domestici.

source: We will use `Vultr <https://www.vultr.com/>`_ hosting as an example of a VPS, although `DigitalOcean <https://www.digitalocean.com/>`_, `Amazon EC2 <https://aws.amazon.com/ec2/>`_, `Google Cloud <https://cloud.google.com/compute/>`_, `Choopa <https://www.choopa.com/>`_ and `OVH <https://www.ovh.com.au/>`_ are also popular choices. First create an account and add credit. Then go to the **Servers** menu item on the left and click **+** to add a new server. Select a location for your new server on the following screen:
it: Utilizzeremo l'hosting `Vultr <https://www.vultr.com/>`_ come esempio di VPS, sebbene `DigitalOcean <https://www.digitalocean.com/>`_, `Amazon EC2 <https ://aws.amazon.com/ec2/>`_, `Google Cloud <https://cloud.google.com/compute/>`_, `Choopa <https://www.choopa.com/>` _ e `OVH <https://www.ovh.com.au/>`_ sono scelte popolari. Per prima cosa crea un account e aggiungi credito. Quindi vai alla voce di menu **Server** a sinistra e fai clic su **++** per aggiungere un nuovo server. Seleziona una posizione per il tuo nuovo server nella schermata seguente:

source: Vultr server location selection screen
it: Schermata di selezione della posizione del server Vultr

source: Select Ubuntu 20.04 x64 as the server type. We use this LTS release of Ubuntu instead of the latest version because LTS releases are supported with security updates for 5 years, instead of the usual 9 months.
it: Seleziona Ubuntu 20.04 x64 come tipo di server. Usiamo questa versione LTS di Ubuntu invece della versione più recente perché le versioni LTS sono supportate con aggiornamenti di sicurezza per 5 anni, invece dei soliti 9 mesi.

source: Vultr server type selection screen
it: Schermata di selezione del tipo di server Vultr

source: Select a server size offering at least 2GB of memory.
it: Seleziona una dimensione del server che offra almeno 2 GB di memoria.

source: Vultr server size selection screen
it: Schermata di selezione delle dimensioni del server Vultr

source: Enter a hostname and label for your server. In this example we will use ``dashmn1`` as the hostname.
it: Inserisci un nome host e un'etichetta per il tuo server. In questo esempio utilizzeremo ``dashmn1`` come nome host.

source: Vultr server hostname & label selection screen
it: Schermata di selezione del nome host e dell'etichetta del server Vultr

source: Vultr will now install your server. This process may take a few minutes.
it: Vultr ora installerà il tuo server. Questo processo potrebbe richiedere alcuni minuti.

source: Vultr server installation screen
it: Schermata di installazione del server Vultr

source: Click **Manage** when installation is complete and take note of the IP address, username and password.
it: Fai clic su **Gestisci** una volta completata l'installazione e prendi nota dell'indirizzo IP, del nome utente e della password.

source: Vultr server management screen
it: Schermata di gestione del server Vultr

source: Set up your operating system
it: Configura il tuo sistema operativo

source: We will begin by connecting to your newly provisioned server. On Windows, we will first download an app called PuTTY to connect to the server. Go to the `PuTTY download page <https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html>`_ and select the appropriate MSI installer for your system. On Mac or Linux you can ssh directly from the terminal - simply type ``ssh root@<server_ip>`` and enter your password when prompted.
it: Inizieremo connettendoci al server appena fornito. Su Windows, scaricheremo prima un'app chiamata PuTTY per connetterci al server. Vai alla `pagina di download di PuTTY <https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html>`_ e seleziona il programma di installazione MSI appropriato per il tuo sistema. Su Mac o Linux puoi eseguire ssh direttamente dal terminale: digita semplicemente ``ssh root@`` e inserisci la password quando richiesto.

source: PuTTY download page
it: Pagina di download di PuTTY

source: Double-click the downloaded file to install PuTTY, then run the app from your Start menu. Enter the IP address of the server in the **Host Name** field and click **Open**. You may see a certificate warning, since this is the first time you are connecting to this server. You can safely click **Yes** to trust this server in the future.
it: Fai doppio clic sul file scaricato per installare PuTTY, quindi esegui l'app dal menu Start. Inserisci l'indirizzo IP del server nel campo **Nome host** e fai clic su **Apri**. Potresti visualizzare un avviso relativo al certificato, poiché questa è la prima volta che ti connetti a questo server. Puoi tranquillamente fare clic su **Sì** per considerare attendibile questo server in futuro.

source: PuTTY security alert when connecting to a new server
it: Avviso di sicurezza PuTTY quando ci si connette a un nuovo server

source: You are now connected to your server and should see a terminal window. Begin by logging in to your server with the user ``root`` and password supplied by your hosting provider.
it: Ora sei connesso al tuo server e dovresti vedere una finestra terminale. Inizia accedendo al tuo server con l'utente "root" e la password fornita dal tuo provider di hosting.

source: Password challenge when connecting to your VPS for the first time
it: Verifica della password quando ti connetti al tuo VPS per la prima volta

source: You should immediately change the root password and store it in a safe place for security. You can copy and paste any of the following commands by selecting them in your browser, pressing **Ctrl + C**, then switching to the PuTTY window and right-clicking in the window. The text will paste at the current cursor location::
it: Dovresti cambiare immediatamente la password di root e conservarla in un luogo sicuro per sicurezza. Puoi copiare e incollare uno qualsiasi dei seguenti comandi selezionandoli nel browser, premendo **Ctrl + C**, quindi passando alla finestra PuTTY e facendo clic con il pulsante destro del mouse nella finestra. Il testo verrà incollato nella posizione corrente del cursore::

source: Enter and confirm a new password (preferably long and randomly generated). Next we will create a new user with the following command, replacing ``<username>`` with a username of your choice::
it: Inserisci e conferma una nuova password (preferibilmente lunga e generata casualmente). Successivamente creeremo un nuovo utente con il seguente comando, sostituendo ``<username>`` con un nome utente a tua scelta::

source: You will be prompted for a password. Enter and confirm using a new password (different to your root password) and store it in a safe place. You will also see prompts for user information, but this can be left blank. Once the user has been created, we will add them to the sudo group so they can perform commands as root::
it: Ti verrà richiesta una password. Inserisci e conferma utilizzando una nuova password (diversa dalla password di root) e conservala in un luogo sicuro. Verranno inoltre visualizzate le richieste per le informazioni sull'utente, ma è possibile lasciarlo vuoto. Una volta creato l'utente, lo aggiungeremo al gruppo sudo in modo che possa eseguire comandi come root::

source: Now, while still as root, we will update the system from the Ubuntu package repository::
it: Ora, sempre come root, aggiorneremo il sistema dal repository dei pacchetti Ubuntu::

source: The system will show a list of upgradable packages. Press **Y** and **Enter** to install the packages. We will now install a firewall (and some other packages we will use later), add swap memory and reboot the server to apply any necessary kernel updates, and then login to our newly secured environment as the new user::
it: Il sistema mostrerà un elenco di pacchetti aggiornabili. Premi **Y** e **Invio** per installare i pacchetti. Ora installeremo un firewall (e alcuni altri pacchetti che utilizzeremo in seguito), aggiungeremo memoria di swap e riavvieremo il server per applicare eventuali aggiornamenti del kernel necessari, quindi accederemo al nostro ambiente appena protetto come nuovo utente::

source: (press **Y** and **Enter** to confirm)
it: (premi **Y** e **Invio** per confermare)

source: Add the following line at the end of the file (press tab to separate each word/number), then press **Ctrl + X** to close the editor, then **Y** and **Enter** save the file.
it: Aggiungi la seguente riga alla fine del file (premi Tab per separare ogni parola/numero), quindi premi **Ctrl + X** per chiudere l'editor, quindi **Y** e **Invio** salva il file .

source: Finally, in order to prevent brute force password hacking attacks, we will install fail2ban and disable root login over ssh. These steps are optional, but highly recommended. Start with fail2ban::
it: Infine, per prevenire attacchi di hacking di password con forza bruta, installeremo fail2ban e disabiliteremo l'accesso root su ssh. Questi passaggi sono facoltativi, ma altamente consigliati. Inizia con fail2ban::

source: Create a new configuration file::
it: Crea un nuovo file di configurazione::

source: And paste in the following configuration::
it: E incolla la seguente configurazione::

source: Then press **Ctrl + X** to close the editor, then **Y** and **Enter** save the file. Retart and enable the fail2ban service::
it: Quindi premi **Ctrl + X** per chiudere l'editor, quindi **Y** e **Invio** salvano il file. Riavvia e abilita il servizio fail2ban::

source: Next, open the SSH configuration file to disable root login over SSH::
it: Successivamente, apri il file di configurazione SSH per disabilitare l'accesso root su SSH::

source: Locate the line that reads ``PermitRootLogin yes`` and set it to ``PermitRootLogin no``. Directly below this, add a line which reads ``AllowUsers <username>``, replacing ``<username>`` with the username you selected above. Then press **Ctrl + X** to close the editor, then **Y** and **Enter** save the file.
it: Individua la riga che dice ``PermitRootLogin yes`` e impostala su ``PermitRootLogin no``. Direttamente sotto, aggiungi una riga che dice ``AllowUsers <username>``, sostituendo ``<username>`` con il nome utente selezionato sopra. Quindi premi **Ctrl + X** per chiudere l'editor, quindi **Y** e **Invio** salvano il file.

source: Then reboot the server::
it: Quindi riavviare il server::

source: PuTTY will disconnect when the server reboots.
it: PuTTY si disconnetterà al riavvio del server.

source: While this setup includes basic steps to protect your server against attacks, much more can be done. In particular, authenticating with a `public key <https://help.ubuntu.com/community/SSH/OpenSSH/Keys>`_ instead of a username/password combination. Enabling `automatic security updates <https://help.ubuntu.com/community/AutomaticSecurityUpdates>`_ is advisable. More tips are available `here <https://www.cyberciti.biz/tips/linux-security.html>`__.
it: Sebbene questa configurazione includa passaggi di base per proteggere il tuo server dagli attacchi, si può fare molto di più. In particolare, l'autenticazione con una `chiave pubblica <https://help.ubuntu.com/community/SSH/OpenSSH/Keys>`_ invece di una combinazione nome utente/password. È consigliabile abilitare gli `aggiornamenti automatici di sicurezza <https://help.ubuntu.com/community/AutomaticSecurityUpdates>`_. Ulteriori suggerimenti sono disponibili `qui <https://www.cyberciti.biz/tips/linux-security.html>`__.

source: Send the collateral
it: Invia il collaterale

source: A Dash address with a single unspent transaction output (UTXO) of exactly 1000 DASH is required to operate a masternode. Once it has been sent, various keys regarding the transaction must be extracted for later entry in a configuration file and registration transaction as proof to write the configuration to the blockchain so the masternode can be included in the deterministic list.
it: Per far funzionare un masternode è necessario un indirizzo Dash con un singolo output di transazione non speso (UTXO) esattamente di 1000 DASH. Una volta inviato, è necessario estrarre varie chiavi relative alla transazione per il successivo inserimento in un file di configurazione e registrazione della transazione come prova per scrivere la configurazione sulla blockchain in modo che il masternode possa essere incluso nella lista deterministica.

source: A masternode can be registered from a hardware wallet, the official Dash Core wallet, or a Dash Electrum wallet, although a hardware wallet is highly recommended to enhance security and protect yourself against hacking. This guide will describe the steps for both hardware wallets and Dash Core.
it: Un masternode può essere registrato da un wallet hardware, dal wallet ufficiale Dash Core o da un wallet Dash Electrum, sebbene un wallet hardware sia altamente raccomandato per migliorare la sicurezza e proteggersi dagli attacchi hacker. Questa guida descriverà i passaggi sia per i wallet hardware che per Dash Core.

source: Details of registering a masternode with Dash Electrum can be found on the :ref:`Electrum - Advanced Functions page <electrum-masternodes>`.
it: I dettagli sulla registrazione di un masternode con Dash Electrum possono essere trovati nella pagina :ref:`Electrum - Funzioni avanzate <electrum-masternodes>`.

source: Option 1: Sending from a hardware wallet
it: Opzione 1: invio da un wallet hardware

source: Set up your Trezor using the Trezor wallet at https://wallet.trezor.io/ and send a test transaction to verify that it is working properly. For help on this, see :ref:`this guide <hardware-trezor>` - you may also choose to (carefully!) `add a passphrase <https://blog.trezor.io/passphrase-the-ultimate-protection-for-your-accounts-3a311990925b>`_ to your Trezor to further protect your collateral. Create a new account in your Trezor wallet by clicking **Add account**. Then click the **Receive** tab and send exactly 1000 DASH to the address displayed. If you are setting up multiple masternodes, send 1000 DASH to consecutive addresses within the same new account. You should see the transaction as soon as the first confirmation arrives, usually within a few minutes.
it: Configura il tuo Trezor utilizzando il wallet Trezor su https://wallet.trezor.io/ e invia una transazione di prova per verificare che funzioni correttamente. Per assistenza in merito, consulta :ref:`questa guida <hardware-trezor>` - puoi anche scegliere (con attenzione!) `aggiungere una passphrase <https://blog.trezor.io/passphrase-the-ultimate-protection-for-your- account-3a311990925b>`_ al tuo Trezor per proteggere ulteriormente la tua garanzia. Crea un nuovo account nel tuo wallet Trezor facendo clic su **Aggiungi account**. Quindi fai clic sulla scheda **Ricevi** e invia esattamente 1000 DASH all'indirizzo visualizzato. Se stai configurando più masternode, invia 1000 DASH a indirizzi consecutivi all'interno dello stesso nuovo account. Dovresti vedere la transazione non appena arriva la prima conferma, solitamente entro pochi minuti.

source: Trezor Wallet Receive tab showing successfully received collateral of 1000 DASH
it: Scheda Ricevi di Trezor Wallet che mostra il collaterale ricevuto con successo di 1000 DASH

source: Once the transaction appears, click the QR code on the right to view the transaction on the blockchain. Keep this window open as we complete the following steps, since we will soon need to confirm that 15 confirmations exist, as shown in the following screenshot.
it: Una volta visualizzata la transazione, fai clic sul codice QR a destra per visualizzare la transazione sulla blockchain. Mantieni questa finestra aperta mentre completiamo i passaggi successivi, poiché presto dovremo confermare che esistono 15 conferme, come mostrato nello screenshot seguente.

source: Trezor blockchain explorer showing 15 confirmations for collateral transfer
it: Trezor blockchain explorer che mostra 15 conferme per il trasferimento di garanzie

source: While we are waiting for 15 confirmations, download the latest version of the Dash Masternode Tool (DMT) from the GitHub releases page `here <https://github.com/Bertrand256/dash-masternode-tool/releases>`__. Unzip and run the file. The following window appears.
it: Mentre aspettiamo 15 conferme, scarica l'ultima versione di Dash Masternode Tool (DMT) dalla pagina delle versioni di GitHub `qui <https://github.com/Bertrand256/dash-masternode-tool/releases>`__. Decomprimere ed eseguire il file. Viene visualizzata la seguente finestra.

source: Dash Masternode Tool startup screen
it: Schermata di avvio di Dash Masternode Tool
