Repository: thephez/dash-user-docs
Catalog: locale/*/LC_MESSAGES/docs/user/masternodes/setup.po
Languages: it

source: The editor appears with the existing masternode configuration. Add or uncomment this line in the file, replacing the key with your BLS private key generated above::
it: L'editor appare con la configurazione del masternode esistente. Aggiungi o rimuovi il commento da questa riga nel file, sostituendo la chiave con la chiave privata BLS generata sopra::

source: We will now prepare the transaction used to register the masternode on the network.
it: Ora prepareremo la transazione utilizzata per registrare il masternode sulla rete.

source: Prepare a ProRegTx transaction
it: Preparare una transazione ProRegTx

source: A pair of BLS keys for the operator were already generated above, and the private key was entered on the masternode. The public key is used in this transaction as the ``operatorPubKey``.
it: In precedenza è stata già generata una coppia di chiavi BLS per l'operatore e la chiave privata è stata inserita nel masternode. La chiave pubblica viene utilizzata in questa transazione come ``operatorPubKey``.

source: First, we need to get a new, unused address from the wallet to serve as the **owner key address** (``ownerKeyAddr``). This is not the same as the collateral address holding 1000 Dash. Generate a new address as follows::
it: Innanzitutto, dobbiamo ottenere un nuovo indirizzo non utilizzato dal wallet che funga da **indirizzo della chiave del proprietario** (``ownerKeyAddr``). Questo non è lo stesso dell'indirizzo collaterale che contiene 1000 Dash. Genera un nuovo indirizzo come segue::

source: This address can also be used as the **voting key address** (``votingKeyAddr``). Alternatively, you can specify an address provided to you by your chosen voting delegate, or simply generate a new voting key address as follows::
it: Questo indirizzo può essere utilizzato anche come **indirizzo chiave di voto** (``votingKeyAddr``). In alternativa, puoi specificare un indirizzo fornito dal delegato votante prescelto o semplicemente generare un nuovo indirizzo chiave di voto come segue::

source: Then either generate or choose an existing address to receive the **owner's masternode payouts** (``payoutAddress``). It is also possible to use an address external to the wallet::
it: Quindi genera o scegli un indirizzo esistente per ricevere i **pagamenti del masternode del proprietario** (``payoutAddress``). E' possibile utilizzare anche un indirizzo esterno al wallet::

source: You can also optionally generate and fund another address as the **transaction fee source** (``feeSourceAddress``). If you selected an external payout address, you must specify a fee source address.
it: Puoi anche opzionalmente generare e finanziare un altro indirizzo come **fonte della commissione di transazione** (``feeSourceAddress``). Se hai selezionato un indirizzo di pagamento esterno, devi specificare un indirizzo di origine della commissione.

source: Either the payout address or fee source address must have enough balance to pay the transaction fee, or the ``register_prepare`` transaction will fail.
it: L'indirizzo di pagamento o l'indirizzo di origine della commissione deve avere un saldo sufficiente per pagare la commissione di transazione, altrimenti la transazione "register_prepare" fallirà.

source: The private keys to the owner and fee source addresses must exist in the wallet submitting the transaction to the network. If your wallet is protected by a password, it must now be unlocked to perform the following commands. Unlock your wallet for 5 minutes::
it: Le chiavi private del proprietario e gli indirizzi della fonte delle commissioni devono essere presenti nel portafoglio che invia la transazione alla rete. Se il tuo portafoglio è protetto da password, ora deve essere sbloccato per eseguire i seguenti comandi. Sblocca il tuo portafoglio per 5 minuti::

source: We will now prepare an unsigned ProRegTx special transaction using the ``protx register_prepare`` command. This command has the following syntax::
it: Ora prepareremo una transazione speciale ProRegTx senza segno utilizzando il comando ``protx Register_prepare``. Questo comando ha la seguente sintassi::

source: Open a text editor such as notepad to prepare this command. Replace each argument to the command as follows:
it: Apri un editor di testo come Blocco note per preparare questo comando. Sostituisci ogni argomento del comando come segue:

source: ``collateralHash``: The txid of the 1000 Dash collateral funding transaction
it: ``collateralHash``: il txid della transazione di finanziamento collaterale 1000 Dash

source: ``collateralIndex``: The output index of the 1000 Dash funding transaction
it: ``collateralIndex``: l'indice di output della transazione di finanziamento 1000 Dash

source: ``ipAndPort``: Masternode IP address and port, in the format ``x.x.x.x:yyyy``
it: ``ipAndPort``: Indirizzo IP e porta del Masternode, nel formato ``x.x.x.x:yyyy``

source: ``ownerKeyAddr``: The new Dash address generated above for the owner/voting address
it: ``ownerKeyAddr``: il nuovo indirizzo Dash generato sopra per l'indirizzo del proprietario/voto

source: ``operatorPubKey``: The BLS public key generated above (or provided by your hosting service)
it: ``operatorPubKey``: la chiave pubblica BLS generata sopra (o fornita dal tuo servizio di hosting)

source: ``votingKeyAddr``: The new Dash address generated above, or the address of a delegate, used for proposal voting
it: ``votingKeyAddr``: il nuovo indirizzo Dash generato sopra, o l'indirizzo di un delegato, utilizzato per la votazione della proposta

source: ``operatorReward``: The percentage of the block reward allocated to the operator as payment
it: ``operatorReward``: La percentuale del premio in blocco assegnato all'operatore come pagamento

source: ``payoutAddress``: A new or existing Dash address to receive the owner's masternode rewards
it: ``payoutAddress``: un indirizzo Dash nuovo o esistente per ricevere i premi masternode del proprietario

source: ``feeSourceAddress``: An (optional) address used to fund ProTx fee. ``payoutAddress`` will be used if not specified.
it: ``feeSourceAddress``: un indirizzo (facoltativo) utilizzato per finanziare la tariffa ProTx. Se non specificato verrà utilizzato ``payoutAddress``.

source: Note that the operator is responsible for :ref:`specifying their own reward <dip3-update-service>` address in a separate ``update_service`` transaction if you specify a non-zero ``operatorReward``. The owner of the masternode collateral does not specify the operator's payout address.
it: Tieni presente che l'operatore è responsabile di :ref:`specificare il proprio indirizzo di ricompensa <dip3-update-service>` in una transazione ``update_service`` separata se specifichi un ``operatorReward`` diverso da zero. Il proprietario della garanzia masternode non specifica l'indirizzo di pagamento dell'operatore.

source: Example (remove line breaks if copying)::
it: Esempio (rimuovere le interruzioni di riga durante la copia)::

source: Next we will use the ``collateralAddress`` and ``signMessage`` fields to sign the transaction, and the output of the ``tx`` field to submit the transaction.
it: Successivamente utilizzeremo i campi ``collateralAddress`` e ``signMessage`` per firmare la transazione e l'output del campo ``tx`` per inviare la transazione.

source: Sign the ProRegTx transaction
it: Firma la transazione ProRegTx

source: We will now sign the content of the ``signMessage`` field using the private key for the collateral address as specified in ``collateralAddress``. Note that no internet connection is required for this step, meaning that the wallet can remain disconnected from the internet in cold storage to sign the message. In this example we will again use Dash Core, but it is equally possible to use the signing function of a hardware wallet. The command takes the following syntax::
it: Ora firmeremo il contenuto del campo ``signMessage`` utilizzando la chiave privata per l'indirizzo del collaterale come specificato in ``collateralAddress``. Tieni presente che per questo passaggio non è necessaria alcuna connessione Internet, il che significa che il wallet può rimanere disconnesso da Internet nella cella frigorifera per firmare il messaggio. In questo esempio utilizzeremo nuovamente Dash Core, ma è ugualmente possibile utilizzare la funzione di firma di un wallet hardware. Il comando assume la seguente sintassi::

source: Example::
it: Esempio::

source: Submit the signed message
it: Invia il messaggio firmato

source: We will now submit the ProRegTx special transaction to the blockchain to register the masternode. This command must be sent from a Dash Core wallet holding a balance on either the ``feeSourceAddress`` or ``payoutAddress``, since a standard transaction fee is involved. The command takes the following syntax::
it: Ora invieremo la transazione speciale ProRegTx alla blockchain per registrare il masternode. Questo comando deve essere inviato da un wallet Dash Core che contiene un saldo su "feeSourceAddress" o "payoutAddress", poiché è coinvolta una commissione di transazione standard. Il comando assume la seguente sintassi::

source: Where:
it: Dove:

source: ``tx``: The serialized transaction previously returned in the ``tx`` output field from the ``protx register_prepare`` command
it: ``tx``: La transazione serializzata precedentemente restituita nel campo di output ``tx`` dal comando ``protx Register_prepare``

source: ``sig``: The message signed with the collateral key from the ``signmessage`` command
it: ``sig``: il messaggio firmato con la chiave collaterale dal comando ``signmessage``

source: Your masternode is now registered and will appear on the Deterministic Masternode List after the transaction is mined to a block. You can view this list on the **Masternodes -> DIP3 Masternodes** tab of the Dash Core wallet, or in the console using the command ``protx list valid``, where the txid of the final ``protx register_submit`` transaction identifies your masternode.
it: Il tuo masternode è ora registrato e apparirà nell'elenco dei Masternode deterministici dopo che la transazione sarà stata estratta in un blocco. Puoi visualizzare questo elenco nella scheda **Masternodes -> DIP3 Masternodes** del wallet Dash Core o nella console utilizzando il comando ``protx list valid``, dove il txid del file finale ``protx Register_submit`` la transazione identifica il tuo masternode.

source: At this point you can go back to your terminal window and monitor your masternode by entering ``~/.dashcore/dash-cli masternode status`` or using the **Get status** function in DMT.
it: A questo punto puoi tornare alla finestra del terminale e monitorare il tuo masternode inserendo ``~/.dashcore/dash-cli masternode status`` o utilizzando la funzione **Get status** in DMT.

source: Option 3: Registering from Dash Electrum wallet
it: Opzione 3: registrazione dal wallet Dash Electrum

source: Dash Electrum supports registering and managing masternodes. Details can be found on the :ref:`Electrum - Advanced Functions page <electrum-masternodes>`. If combined with Electrum's :ref:`multisig features <electrum-multisig>` the masternode collateral can be stored in a multisig wallet for increased security flexibility.
it: Dash Electrum supporta la registrazione e la gestione dei masternode. I dettagli possono essere trovati nella pagina :ref:`Electrum - Funzioni avanzate <electrum-masternodes>`. Se combinato con le :ref:`funzionalità multisig <electrum-multisig>` di Electrum, il collaterale masternode può essere archiviato in un portafoglio multisig per una maggiore flessibilità di sicurezza.

source: Always exercise caution when using multisig accounts and verify that each mnemonic is backed up appropriately. See `this page <https://github.com/dashpay/docs/blob/master/wallets/electrum/dip3_p2sh_howto.md>`_ for the Dash Electrum documentation demonstrating how to configure a masternode using a multisig collateral.
it: Prestare sempre attenzione quando si utilizzano account multisig e verificare che venga eseguito il backup appropriato di ogni mnemonico. Vedi `questa pagina <https://github.com/dashpay/docs/blob/master/wallets/electrum/dip3_p2sh_howto.md>`_ per la documentazione di Dash Electrum che dimostra come configurare un masternode utilizzando un collaterale multisig.
