Repository: thephez/dash-user-docs
Catalog: locale/*/LC_MESSAGES/docs/user/masternodes/setup.po
Languages: it

source: Click the third button from the left **Check Dash Network Connection** in the top left corner of the main window to verify that the connection is working. Then connect your Trezor device and click the next button **Test Hardware Wallet Connection** to verify the Trezor connection is working.
it: Fai clic sul terzo pulsante da sinistra **Verifica connessione di rete Dash** nell'angolo in alto a sinistra della finestra principale per verificare che la connessione funzioni. Quindi collega il tuo dispositivo Trezor e fai clic sul pulsante successivo **Test connessione hardware Wallet** per verificare che la connessione Trezor funzioni.

source: Dash Masternode Tool successful connection confirmations
it: Conferma di connessione riuscita col Dash Masternode Tool

source: We will now use DMT to enter some basic information about the masternode and extract the transaction ID. Carry out the following sequence of steps as shown in this screenshot:
it: Utilizzeremo ora DMT per inserire alcune informazioni di base sul masternode ed estrarre l'ID della transazione. Eseguire la seguente sequenza di passaggi come mostrato in questa schermata:

source: Dash Masternode Tool configuration steps
it: Step per configurare Dash Masternode Tool

source: Click the **New** button.
it: Fare clic sul pulsante **Nuovo**.

source: Enter a name for your masternode. The host name you specified for your VPS above is a good choice.
it: Inserisci un nome per il tuo masternode. Il nome host specificato sopra per il tuo VPS è una buona scelta.

source: Enter the IP address of your masternode. This was given to you by the VPS provider when you set up the server. Then enter the TCP port number. This should be 9999.
it: Inserisci l'indirizzo IP del tuo masternode. Questo ti è stato fornito dal provider VPS quando hai configurato il server. Quindi inserisci il numero della porta TCP. Dovrebbe essere 9999.

source: Click **Locate collateral** to view unused collateral funding transactions available on the connected hardware wallet. Select the address to which you sent 1000 Dash and click **Apply**. The **Collateral address**, **path**, **Collateral TX hash** and **index** fields should be filled automatically.
it: Fai clic su **Trova garanzie** per visualizzare le transazioni di finanziamento delle garanzie non utilizzate disponibili sul wallet hardware connesso. Seleziona l'indirizzo a cui hai inviato 1000 Dash e fai clic su **Applica**. I campi **Indirizzo collaterale**, **percorso**, **Hash TX collaterale** e **indice** devono essere compilati automaticamente.

source: Dash Masternode Tool with masternode configuration
it: Dash Masternode Tool con configurazione Masternode

source: Leave DMT open and continue with the next step: :ref:`installing Dash Core on your VPS <masternode-setup-install-dashcore>`.
it: Lascia aperto DMT e continua con il passaggio successivo: :ref:`installazione di Dash Core sul tuo VPS `.

source: Option 2: Sending from Dash Core wallet
it: Opzione 2: invio dal wallet Dash Core

source: Open Dash Core wallet and wait for it to synchronize with the network. It should look like this when ready:
it: Apri il wallet Dash Core e attendi che si sincronizzi con la rete. Dovrebbe assomigliare a questo quando è pronto:

source: Fully synchronized Dash Core wallet
it: Wallet Dash Core completamente sincronizzato

source: Click **Window > Console** to open the console. Type the following command into the console to generate a new Dash address for the collateral::
it: Fai clic su **Finestra > Console** per aprire la console. Digita il seguente comando nella console per generare un nuovo indirizzo Dash per il materiale collaterale::

source: Take note of the collateral address, since we will need it later. The next step is to secure your wallet (if you have not already done so). First, encrypt the wallet by selecting **Settings > Encrypt wallet**. You should use a strong, new password that you have never used somewhere else. Take note of your password and store it somewhere safe or you will be permanently locked out of your wallet and lose access to your funds. Next, back up your wallet file by selecting **File > Backup Wallet**. Save the file to a secure location physically separate to your computer, since this will be the only way you can access our funds if anything happens to your computer. For more details on these steps, see :ref:`here <dashcore-backup>`.
it: Prendi nota dell'indirizzo collaterale, poiché ne avremo bisogno in seguito. Il prossimo passo è proteggere il tuo wallet (se non l'hai già fatto). Innanzitutto, crittografa il portafoglio selezionando **Impostazioni > Crittografa wallet**. Dovresti utilizzare una password nuova e complessa che non hai mai utilizzato altrove. Prendi nota della tua password e conservala in un posto sicuro, altrimenti rimarrai permanentemente bloccato fuori dal tuo wallet e perderai l'accesso ai tuoi fondi. Successivamente, esegui il backup del file del tuo wallet selezionando **File > Backup wallet**. Salva il file in un luogo sicuro fisicamente separato dal tuo computer, poiché questo sarà l'unico modo per accedere ai nostri fondi se succede qualcosa al tuo computer. Per ulteriori dettagli su questi passaggi, vedere :ref:`qui `.

source: Now send exactly 1000 DASH in a single transaction to the new address you generated in the previous step. This may be sent from another wallet, or from funds already held in your current wallet. Once the transaction is complete, view the transaction in a `blockchain explorer <https://insight.dash.org/insight/>`_ by searching for the address. You will need 15 confirmations before you can register the masternode, but you can continue with the next step at this point already: generating your masternode operator key.
it: Ora invia esattamente 1000 DASH in un'unica transazione al nuovo indirizzo che hai generato nel passaggio precedente. Questo può essere inviato da un altro wallet o da fondi già detenuti nel tuo wallet attuale. Una volta completata la transazione, visualizza la transazione in un `blockchain explorer <https://insight.dash.org/insight/>`_ cercando l'indirizzo. Avrai bisogno di 15 conferme prima di poter registrare il masternode, ma a questo punto puoi già procedere con il passaggio successivo: generare la tua chiave operatore masternode.

source: Install Dash Core
it: Installa Dash Core

source: Dash Core is the software behind both the Dash Core GUI wallet and Dash masternodes. If not displaying a GUI, it runs as a daemon on your VPS (dashd), controlled by a simple command interface (dash-cli).
it: Dash Core è il software dietro sia al wallet GUI Dash Core che ai masternode Dash. Se non viene visualizzata una GUI, viene eseguito come demone sul tuo VPS (dashd), controllato da una semplice interfaccia di comando (dash-cli).

source: Open PuTTY or a console again and connect using the username and password you just created for your new, non-root user. The following options are available for installing a Dash masternode:
it: Apri nuovamente PuTTY o una console e connettiti utilizzando il nome utente e la password che hai appena creato per il tuo nuovo utente non root. Sono disponibili le seguenti opzioni per l'installazione di un masternode Dash:

source: Manual installation (this guide)
it: Installazione manuale (questa guida)

source: `xkcd's installation guide <https://www.dash.org/forum/threads/system-wide-masternode-setup-with-systemd-auto-re-start-rfc.39460/>`__
it: `Guida all'installazione di xkcd <https://www.dash.org/forum/threads/system-wide-masternode-setup-with-systemd-auto-re-start-rfc.39460/>`__

source: `dashman installation <https://docs.dash.org/en/0.15.0/masternodes/setup.html#option-1-automated-installation-using-dashman>`__ (deprecated)
it: `installazione dashman <https://docs.dash.org/en/0.15.0/masternodes/setup.html#option-1-automated-installation-using-dashman>`__ (obsoleto)

source: `mn-bootstrap installation <https://docs.dash.org/en/mn-bootstrap/masternodes/setup.html#install-mn-bootstrap>`__ (beta version, currently testnet only)
it: `Installazione di mn-bootstrap <https://docs.dash.org/en/mn-bootstrap/masternodes/setup.html#install-mn-bootstrap>`__ (versione beta, attualmente solo testnet)

source: Manual installation
it: Installazione Manuale

source: To manually download and install the components of your Dash masternode, visit the `GitHub releases page <https://github.com/dashpay/dash/releases>`_ and copy the link to the latest ``x86_64-linux-gnu`` version. Go back to your terminal window and enter the following command, pasting in the address to the latest version of Dash Core by right clicking or pressing **Ctrl + V**::
it: Per scaricare e installare manualmente i componenti del tuo masternode Dash, visita la ``pagina delle versioni di GitHub <https://github.com/dashpay/dash/releases>`_ e copia il collegamento all'ultima ``x86_64-linux-gnu` "versione. Torna alla finestra del terminale e inserisci il comando seguente, incollando l'indirizzo dell'ultima versione di Dash Core facendo clic con il pulsante destro del mouse o premendo **Ctrl + V**::

source: Verify the authenticity of your download by checking its detached signature against the public key published by the Dash Core development team. All releases of Dash are signed using GPG with one of the following keys:
it: Verifica l'autenticità del tuo download controllando la sua firma staccata rispetto alla chiave pubblica pubblicata dal team di sviluppo di Dash Core. Tutte le versioni di Dash sono firmate utilizzando GPG con una delle seguenti chiavi:

source: Alexander Block (codablock) with the key ``63A9 6B40 6102 E091``, `verifiable here on Keybase <https://keybase.io/codablock>`__
it: Alexander Block (codablock) con la chiave ``63A9 6B40 6102 E091``, `verificabile qui su Keybase <https://keybase.io/codablock>`__

source: Pasta (pasta) with the key ``5252 7BED ABE8 7984``, `verifiable here on Keybase <https://keybase.io/pasta>`__
it: Pasta (pasta) con la chiave ``5252 7BED ABE8 7984``, `verificabile qui su Keybase <https://keybase.io/pasta>`__

source: Create a working directory for Dash, extract the compressed archive and copy the necessary files to the directory::
it: Crea una directory di lavoro per Dash, estrai l'archivio compresso e copia i file necessari nella directory:

source: Create a configuration file using the following command::
it: Crea un file di configurazione utilizzando il seguente comando::

source: An editor window will appear. We now need to create a configuration file specifying several variables. Copy and paste the following text to get started, then replace the variables specific to your configuration as follows::
it: Apparirà una finestra dell'editor. Ora dobbiamo creare un file di configurazione specificando diverse variabili. Copia e incolla il seguente testo per iniziare, quindi sostituisci le variabili specifiche della tua configurazione come segue:

source: Replace the fields marked with ``XXXXXXX`` as follows:
it: Sostituisci i campi contrassegnati con ``XXXXXXX`` come segue:

source: ``rpcuser``: enter any string of numbers or letters, no special characters allowed
it: ``rpcuser``: inserisci qualsiasi stringa di numeri o lettere, non sono ammessi caratteri speciali

source: ``rpcpassword``: enter any string of numbers or letters, no special characters allowed
it: ``rpcpassword``: inserisci qualsiasi stringa di numeri o lettere, non sono ammessi caratteri speciali

source: ``externalip``: this is the IP address of your VPS
it: ``externalip``: questo è l'indirizzo IP del tuo VPS

source: Leave the ``masternodeblsprivkey`` field commented out for now. The result should look something like this:
it: Lasciare commentato il campo ``masternodeblsprivkey`` per ora. Il risultato dovrebbe assomigliare a questo:

source: Entering key data in dash.conf on the masternode
it: Immissione dei dati chiave in dash.conf sul masternode

source: Press **Ctrl + X** to close the editor and **Y** and **Enter** save the file. You can now start running Dash on the masternode to begin synchronization with the blockchain::
it: Premi **Ctrl + X** per chiudere l'editor e **Y** e **Invio** salvano il file. Ora puoi iniziare a eseguire Dash sul masternode per iniziare la sincronizzazione con la blockchain::

source: You will see a message reading **Dash Core server starting**. We will now install Sentinel, a piece of software which operates as a watchdog to communicate to the network that your node is working properly::
it: Verrà visualizzato il messaggio **Server Dash Core in avvio**. Ora installeremo Sentinel, un software che funziona da watchdog per comunicare alla rete che il tuo nodo funziona correttamente:

source: You will see a message reading **dashd not synced with network! Awaiting full sync before running Sentinel.** Add dashd and sentinel to crontab to make sure it runs every minute to check on your masternode::
it: Verrà visualizzato il messaggio **dashd non sincronizzato con la rete! In attesa della sincronizzazione completa prima di eseguire Sentinel.** Aggiungi dashd e sentinel a crontab per assicurarti che venga eseguito ogni minuto per controllare il tuo masternode::

source: Choose nano as your editor and enter the following lines at the end of the file::
it: Scegli nano come editor e inserisci le seguenti righe alla fine del file::

source: Press enter to make sure there is a blank line at the end of the file, then press **Ctrl + X** to close the editor and **Y** and **Enter** save the file. We now need to wait for 15 confirmations of the collateral transaction to complete, and wait for the blockchain to finish synchronizing on the masternode. You can use the following commands to monitor progress::
it: Premi Invio per assicurarti che ci sia una riga vuota alla fine del file, quindi premi **Ctrl + X** per chiudere l'editor e **Y** e **Invio** salvano il file. Ora dobbiamo attendere il completamento di 15 conferme della transazione collaterale e attendere che la blockchain finisca di sincronizzarsi sul masternode. È possibile utilizzare i seguenti comandi per monitorare l'avanzamento:

source: When synchronisation is complete, you should see the following response::
it: Una volta completata la sincronizzazione, dovresti vedere la seguente risposta::

source: Continue with the next step to construct the ProTx transaction required to enable your masternode.
it: Continua con il passaggio successivo per costruire la transazione ProTx richiesta per abilitare il tuo masternode.

source: Register your masternode
it: Registra il tuo masternode

source: DIP003 introduced several changes to how a masternode is set up and operated. These changes and the three keys required for the different masternode roles are described briefly under :ref:`dip3-changes` in this documentation.
it: DIP003 ha introdotto diverse modifiche al modo in cui un masternode viene configurato e gestito. Queste modifiche e le tre chiavi richieste per i diversi ruoli masternode sono descritte brevemente in :ref:`dip3-changes` in questa documentazione.

source: Option 1: Registering from a hardware wallet
it: Opzione 1: registrazione da un wallet hardware

source: Go back to DMT and ensure that all fields from the previous step are still filled out correctly. Click **Generate new** for the three private keys required for a DIP003 deterministic masternode:
it: Torna a DMT e assicurati che tutti i campi del passaggio precedente siano ancora compilati correttamente. Fare clic su **Genera nuovo** per le tre chiavi private richieste per un masternode deterministico DIP003:

source: Owner private key
it: Chiave privata del proprietario

source: Operator private key
it: Chiave privata dell'operatore

source: Voting private key
it: Chiave privata di voto

source: Dash Masternode Tool ready to register a new masternode
it: Dash Masternode Tool pronto per registrare un nuovo masternode

source: Then click **Register masternode**. Optionally specify a different **Payout address** and/or **Operator reward**, then click **Continue**. Select **Remote Dash RPC Node (automatic method)**. (See `here <https://github.com/Bertrand256/dash-masternode-tool/blob/master/doc/config-connection-direct.md>`__ for documentation on using your own local RPC node.) and confirm the following two messages:
it: Quindi fare clic su **Registra masternode**. Facoltativamente, specifica un diverso **Indirizzo di pagamento** e/o un **Premio per l'operatore**, quindi fai clic su **Continua**. Seleziona **Nodo RPC Dash remoto (metodo automatico)**. (Vedi `qui <https://github.com/Bertrand256/dash-masternode-tool/blob/master/doc/config-connection-direct.md>`__ per la documentazione sull'utilizzo del tuo nodo RPC locale.) e conferma i seguenti due messaggi:

source: Dash Masternode Tool confirmation dialogs to register a masternode
it: Dash Masternode Tool finestre di dialogo di conferma per registrare un masternode

source: The BLS private key must be entered in the ``dash.conf`` file on the masternode. This allows the masternode to watch the blockchain for relevant Pro*Tx transactions, and will cause it to start serving as a masternode when the signed ProRegTx is broadcast by the owner, as we just did above. Log in to your masternode using ``ssh`` or PuTTY and edit the configuration file as follows::
it: La chiave privata BLS deve essere inserita nel file ``dash.conf`` sul masternode. Ciò consente al masternode di monitorare la blockchain per le transazioni Pro*Tx rilevanti e lo farà iniziare a fungere da masternode quando il ProRegTx firmato viene trasmesso dal proprietario, come abbiamo appena fatto sopra. Accedi al tuo masternode utilizzando ``ssh`` o PuTTY e modifica il file di configurazione come segue:

source: The editor appears with the existing masternode configuration. Add or uncomment this lines in the file, replacing the key with your BLS private key generated above::
it: L'editor appare con la configurazione del masternode esistente. Aggiungi o rimuovi il commento da queste righe nel file, sostituendo la chiave con la chiave privata BLS generata sopra::

source: Press enter to make sure there is a blank line at the end of the file, then press **Ctrl + X** to close the editor and **Y** and **Enter** save the file. Note that providing a ``masternodeblsprivkey`` enables masternode mode, which will automatically force the ``txindex=1``, ``peerbloomfilters=1``, and ``prune=0`` settings necessary to provide masternode service. We now need to restart the masternode for this change to take effect. Enter the following commands, waiting a few seconds in between to give Dash Core time to shut down::
it: Premi Invio per assicurarti che ci sia una riga vuota alla fine del file, quindi premi **Ctrl + X** per chiudere l'editor e **Y** e **Invio** salvano il file. Tieni presente che fornire una ``masternodeblsprivkey`` abilita la modalità masternode, che forzerà automaticamente le impostazioni ``txindex=1``, ``peerbloomfilters=1`` e ``prune=0`` necessarie per fornire il servizio masternode. Ora dobbiamo riavviare il masternode affinché questa modifica abbia effetto. Inserisci i seguenti comandi, aspettando qualche secondo per dare a Dash Core il tempo di spegnersi::

source: At this point you can monitor your masternode by entering ``~/.dashcore/dash-cli masternode status`` or using the **Get status** function in DMT. The final result should appear as follows:
it: A questo punto puoi monitorare il tuo masternode inserendo ``~/.dashcore/dash-cli masternode status`` o utilizzando la funzione **Get status** in DMT. Il risultato finale dovrebbe apparire come segue:

source: dash-cli masternode status output showing successfully registered masternode
it: Output dello stato del masternode dash-cli che mostra il masternode registrato correttamente

source: At this point you can safely log out of your server by typing ``exit``. Congratulations! Your masternode is now running.
it: A questo punto puoi tranquillamente disconnetterti dal tuo server digitando ``exit``. Congratulazioni! Il tuo masternode è ora in esecuzione.

source: Option 2: Registering from Dash Core wallet
it: Opzione 2: registrazione dal wallet Dash Core

source: Identify the funding transaction
it: Identificare la transazione di finanziamento

source: If you used an address in Dash Core wallet for your collateral transaction, you now need to find the txid of the transaction. Click **Window > Console** and enter the following command::
it: Se hai utilizzato un indirizzo nel wallet Dash Core per la transazione collaterale, ora devi trovare il txid della transazione. Fai clic su **Finestra > Console** e inserisci il seguente comando::

source: This should return a string of characters similar to the following::
it: Questo dovrebbe restituire una stringa di caratteri simile alla seguente::

source: The first long string is your ``collateralHash``, while the last number is the ``collateralIndex``.
it: La prima stringa lunga è il tuo ``collateralHash``, mentre l'ultimo numero è il ``collateralIndex``.

source: Generate a BLS key pair
it: Genera una coppia di chiavi BLS

source: A public/private BLS key pair is required to operate a masternode. The private key is specified on the masternode itself, and allows it to be included in the deterministic masternode list once a provider registration transaction with the corresponding public key has been created.
it: Per utilizzare un masternode è necessaria una coppia di chiavi BLS pubblica/privata. La chiave privata è specificata sul masternode stesso, e permette di inserirlo nella lista deterministica dei masternode una volta creata una transazione di registrazione del provider con la corrispondente chiave pubblica.

source: If you are using a hosting service, they may provide you with their public key, and you can skip this step. If you are hosting your own masternode or have agreed to provide your host with the BLS private key, generate a BLS public/private keypair in Dash Core by clicking **Tools > Console** and entering the following command::
it: Se stai utilizzando un servizio di hosting, potrebbero fornirti la loro chiave pubblica e puoi saltare questo passaggio. Se stai ospitando il tuo masternode o hai accettato di fornire al tuo host la chiave privata BLS, genera una coppia di chiavi pubblica/privata BLS in Dash Core facendo clic su **Strumenti > Console** e inserendo il seguente comando::

source: **These keys are NOT stored by the wallet and must be kept secure, similar to the value provided in the past by the** ``masternode genkey`` **command.**
it: **Queste chiavi NON vengono archiviate dal portafoglio e devono essere mantenute al sicuro, in modo simile al valore fornito in passato dal** comando ``masternode genkey`` **.**

source: Add the private key to your masternode configuration
it: Aggiungi la chiave privata alla configurazione del tuo masternode

source: The public key will be used in following steps. The private key must be entered in the ``dash.conf`` file on the masternode. This allows the masternode to watch the blockchain for relevant Pro*Tx transactions, and will cause it to start serving as a masternode when the signed ProRegTx is broadcast by the owner (final step below). Log in to your masternode using ``ssh`` or PuTTY and edit the configuration file as follows::
it: La chiave pubblica verrà utilizzata nei passaggi successivi. La chiave privata deve essere inserita nel file ``dash.conf`` sul masternode. Ciò consente al masternode di monitorare la blockchain per le transazioni Pro*Tx rilevanti e lo farà iniziare a fungere da masternode quando il ProRegTx firmato verrà trasmesso dal proprietario (passaggio finale di seguito). Accedi al tuo masternode utilizzando ``ssh`` o PuTTY e modifica il file di configurazione come segue:
